{"id":21,"date":"2023-08-01T17:01:02","date_gmt":"2023-08-01T17:01:02","guid":{"rendered":"https:\/\/news.craftyjs.watch2now.com\/?p=21"},"modified":"2023-08-01T17:01:03","modified_gmt":"2023-08-01T17:01:03","slug":"the-price-of-water-at-water-atms-increased-by-73-percent","status":"publish","type":"post","link":"https:\/\/news.craftyjs.watch2now.com\/2023\/08\/01\/the-price-of-water-at-water-atms-increased-by-73-percent\/","title":{"rendered":"The price of water at water ATMs increased by 73 percent"},"content":{"rendered":"\n<p>Dhaka Wasser Water ATM booth project has become popular day by day.&nbsp;The demand for this pure water is high in the areas of Dhaka where water quality is poor.Drinkwell received the US State Department&#8217;s Award for Corporate Excellence (ACE) for this project in collaboration with Dhaka WASA to provide low-cost clean water.&nbsp;However, without any prior announcement, Dhaka WASA has increased the water price of water ATMs by 73 percent.<\/p>\n\n\n\n<p>Customers expressed their anger about this.&nbsp;They say that the water supplied by Dhaka WASA is not pure.&nbsp;Boil the water and drink it.&nbsp;Pure water from water ATM booths is very good.&nbsp;But there is no justification for suddenly increasing the price of water by 73 percent.<\/p>\n\n\n\n<p>From Tuesday (01 August) the price of water per liter has been fixed at 70 paise.&nbsp;10 paise VAT will be added to this.&nbsp;Till Monday (July 31), this water was sold at 46 paisa including VAT.<\/p>\n\n\n\n<p>According to the concerned, the price of water at water ATM booths has been increased &#8216;in view of the current global situation&#8217;.&nbsp;But those concerned could not clearly say what WASA meant by the global situation.<\/p>\n\n\n\n<p>A WASA official said on condition of anonymity that the cost of setting up and running water ATM booths is increasing.&nbsp;So the price of water has to be increased.&nbsp;But there was no need to increase 34 paisa per liter of water.<\/p>\n\n\n\n<p>Shamima Akhter took water from Dhaka Wasser Water ATM booth at Moghbazar wireless intersection water pump.&nbsp;He said, the water in the house is not fit to drink.&nbsp;The water quality here is good.&nbsp;No smell.&nbsp;He said that he did not know about the increase in the price of water by 34 paise per litre.<\/p>\n\n\n\n<p>Shamima said, purifying Wasa water takes time and is also risky.&nbsp;I have been drinking pure water from Wasar Water ATM booth for almost two years now.&nbsp;Now if the price of water is increased it will be a bit difficult for the common people.<\/p>\n\n\n\n<p>Suman Mridha was taking water from Pallaveer&#8217;s booth.&nbsp;He said, WASA is a service organization.&nbsp;Hundreds of crores of subsidies are given by the government every year.&nbsp;There is no justification for suddenly increasing the prices now.<\/p>\n\n\n\n<p>Rameshwar Das, Director of Water ATM Booth Project and Executive Engineer of Dhaka WASA, said that initially ATMs were installed to provide clean water to the lower class people of the city.&nbsp;Due to the quality of ATM water, all classes of people are now customers.&nbsp;The quality of this water is same as bottled water.<\/p>\n\n\n\n<p>He said, but I cannot tell the exact reason why the price of water has been increased by 73 percent.&nbsp;My superiors can speak well about increasing the price of water at water ATM booths.&nbsp;My project has nothing to do with raising the price of this water.<\/p>\n\n\n\n<p>Earlier, in May 2017, the first water ATM booth was set up in the capital&#8217;s Muga to provide safe water to the city&#8217;s poor at low cost.&nbsp;WASA contracted with Drinkwell of the United States for this work.&nbsp;Later they started setting up booths in different parts of the city as per the demand of the customers.&nbsp;The water extracted from underground is sold through purification in these ATM booths.<\/p>\n\n\n\n<p>After this, on 18 November 2022, Drinkwell received the Award for Corporate Excellence (ACE) from the United States Department of State for jointly setting up water ATM booths with Dhaka Wasa to provide low-cost clean water to the capital&#8217;s residents.&nbsp;The organization received this award in the climate tolerance category.<\/p>\n\n\n\n<p>It is known that till now 295 water ATM booths have been set up in different areas of the capital by Dhaka WASA and American non-governmental organization (NGO) Drinkwell.&nbsp;An RFID card like a bank&#8217;s ATM card is placed in a specific location in the machine and pure drinking water is automatically dispensed.&nbsp;Customers can recharge the card from 10 taka to 999 taka.&nbsp;Water can be collected daily from 8 am to 4 pm.&nbsp;The number of customers of water ATM booths to get this service is increasing day by day.&nbsp;Now the number of ATM booth card customers is around two lakh 90 thousand.&nbsp;An average of 14 lakh liters of water is being sold every day.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Dhaka Wasser Water ATM booth project has become popular day by day.&nbsp;The demand for this pure water is high in the areas of Dhaka where water quality is poor.Drinkwell received the US State Department&#8217;s Award for Corporate Excellence (ACE) for this project in collaboration with Dhaka WASA to provide low-cost clean water.&nbsp;However, without any prior &#8230; <a title=\"The price of water at water ATMs increased by 73 percent\" class=\"read-more\" href=\"https:\/\/news.craftyjs.watch2now.com\/2023\/08\/01\/the-price-of-water-at-water-atms-increased-by-73-percent\/\" aria-label=\"More on The price of water at water ATMs increased by 73 percent\">Read more<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/news.craftyjs.watch2now.com\/wp-json\/wp\/v2\/posts\/21"}],"collection":[{"href":"https:\/\/news.craftyjs.watch2now.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/news.craftyjs.watch2now.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/news.craftyjs.watch2now.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/news.craftyjs.watch2now.com\/wp-json\/wp\/v2\/comments?post=21"}],"version-history":[{"count":1,"href":"https:\/\/news.craftyjs.watch2now.com\/wp-json\/wp\/v2\/posts\/21\/revisions"}],"predecessor-version":[{"id":24,"href":"https:\/\/news.craftyjs.watch2now.com\/wp-json\/wp\/v2\/posts\/21\/revisions\/24"}],"wp:attachment":[{"href":"https:\/\/news.craftyjs.watch2now.com\/wp-json\/wp\/v2\/media?parent=21"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/news.craftyjs.watch2now.com\/wp-json\/wp\/v2\/categories?post=21"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/news.craftyjs.watch2now.com\/wp-json\/wp\/v2\/tags?post=21"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}